src/cf/InformationRegisters/МП_ИзмененныеТрудозатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_ИзмененныеТрудозатраты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Удалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДобавления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/МП_ИзмененияВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
//Изменяет запись о трудозатрате для дальнейшего удаления в мобильном приложении
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники - Сотрудник
//  День - Дата - День для отбора трудозатраты
//  НомерДобавления - Число - НомерДобавления для трудозатраты
//

Процедура ЗафиксироватьУдалениеЗаписиОТрудозатрате(Сотрудник, День, НомерДобавления) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМобильныеПриложения") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерДобавления) Тогда
		Возврат;
	КонецЕсли;
	
	Пользователь = Сотрудники.ЛюбойПользовательСотрудника(Сотрудник);
	
	Если Справочники.ПользователиМобильногоПриложения.ЭтоПользовательМП(Пользователь) Тогда
		
		РегистрыСведений.МП_ИзмененныеТрудозатраты.УдалитьЗаписьОТрудозатрате(Пользователь,
			День,
			НомерДобавления);
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
